In [3]:
import numpy as np
import pandas as pd

In [4]:
DATA_DIR = "C:/4-1/names"

In [5]:
def count_top_3(years=[]):
    def sort_top(year):
            x = pd.read_csv('{}/yob{}.txt'.format(DATA_DIR, year), 
                    names=['Name', 'Gender', 'Count'])
            top = x.sort_values(by='Count', ascending=False)
            return top
    count_top_all = []
    for year in years:
        count_top_all.append(sort_top(year))
    result = pd.concat(count_top_all)
    name = result.groupby('Name')
    result = name.sum()
    result = result.sort_values(by='Count',ascending=False)
    return (result[:3])

In [6]:
count_top_3([1900, 1950, 2000])

         Count
Name
James   111795
John    109595
Robert  101381

In [7]:
count_top_3([1880])

         Count
Name
John      9701
William   9562
Mary      7092

In [8]:
def count_dynamics(years=[]):
    def gender_count(year):
        x = pd.read_csv('{}/yob{}.txt'.format(DATA_DIR, year), 
                        names=['Name', 'Gender', 'Count'])
        gender = x.groupby('Gender')
        x = gender.sum()
        return x
    
    for year in years:
        print('количества имен за ' + str(year) + ' год в разрезе полов')
        print(gender_count(year))

In [9]:
count_dynamics([1900, 1950, 2000])

количества имен за 1900 год в разрезе полов
         Count
Gender
F       299810
M       150486
количества имен за 1950 год в разрезе полов
          Count
Gender
F       1713259
M       1790871
количества имен за 2000 год в разрезе полов
          Count
Gender
F       1814922
M       1962744

In [10]:
def count_dynamics_new(years=[]):
    names_by_year = {}
    for year in years:
        names_by_year[year] = pd.read_csv('{}/yob{}.txt'.format(DATA_DIR, year),
            names=['Name','Gender','Count']
        )
    names_all = pd.concat(names_by_year, names=['Year', 'Pos'])
    name_dynamics = names_all.groupby([names_all.index.get_level_values(0), 'Gender']).sum()
    name_dynamics.query('Gender == ["F", "M"]').unstack('Gender')
    return name_dynamics

In [11]:
count_dynamics_new([1900, 1950, 2000])

               Count
Year Gender
1900 F        299810
     M        150486
1950 F       1713259
     M       1790871
2000 F       1814922
     M       1962744